
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокМетаданных = Параметры.СписокМетаданных;
	ВыводитьНеиспользуемыеОбъекты = Параметры.ВыводитьНеиспользуемыеОбъекты;
	ВыводитьНеиспользуемыеРеквизиты = Параметры.ВыводитьНеиспользуемыеРеквизиты;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ВладелецФормы.СписокМетаданных.Очистить();
	Для Каждого Элемент Из СписокМетаданных Цикл
		ВладелецФормы.СписокМетаданных.Добавить(
			Элемент.Значение,
			Элемент.Представление,
			Элемент.Пометка);
	КонецЦикла;		
	
	ВладелецФормы.ВыводитьНеиспользуемыеОбъекты = ВыводитьНеиспользуемыеОбъекты;
	ВладелецФормы.ВыводитьНеиспользуемыеРеквизиты = ВыводитьНеиспользуемыеРеквизиты;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
